# homework les 1.4
# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции


# Не смог сделать с циклом :(
user_number = input('Введите любое целое положительное число: ')
print(max(user_number))
